gender: list[str] = ['Мужской',
                     'Женский']

male_last_name: list[str] = ['Иванов', 'Петров', 'Федоров', 'Орлов', 'Коваленко', 'Тимофеев', 'Тимошин', 'Кузнецов', 'Прохоров',
                             'Кузьмичев', 'Молебнов', 'Бельков', 'Ромаданов', 'Гвоздев', 'Клементьев', 'Каренин', 'Путиловский',
                             'Чепурнов', 'Куприн', 'Стручковский', 'Ковалев', 'Андреев', 'Романов', 'Васильев']

male_name: list[str] = ['Александр', 'Алексей', 'Андрей', 'Иван', 'Максим', 'Дмитрий', 'Никита', 'Николай', 'Семен',
                        'Валерий', 'Петр', 'Иван', 'Олег', 'Михаил', 'Юрий', 'Антон', 'Игорь', 'Сергей', 'Константин']

male_patronymic: list[str] = ['Александрович', 'Алексеевич', 'Андреевич', 'Иванович', 'Максимович', 'Дмитриевич', 'Никитич', 'Николаевич', 'Семенович',
                              'Валерьевич', 'Петрович', 'Иванович', 'Олегович', 'Михайлович', 'Юрьевич', 'Антонович', 'Игоревич', 'Сергеевич', 'Константинович']

female_last_name: list[str] = ['Иванова', 'Петрова', 'Федорова', 'Орлова', 'Коваленко', 'Тимофеева', 'Тимошина', 'Кузнецова', 'Прохорова',
                               'Кузьмичева', 'Молебнова', 'Белькова', 'Ромаданова', 'Гвоздева', 'Клементьева', 'Каренина', 'Путиловская',
                               'Чепурнова', 'Куприна', 'Стручковская', 'Ковалева', 'Андреева', 'Романова', 'Васильева']

female_name: list[str] = ['Ева', 'Есения', 'Ольга', 'Екатерина', 'Елена', 'Анастасия', 'Кристина', 'Наталья', 'Светлана',
                          'Анна', 'Александра', 'Юлия', 'Надежда', 'Оксана', 'Валентина', 'Валерия', 'Виктория', 'Яна']


female_patronymic: list[str] = ['Александровна', 'Алексеевна', 'Андреевна', 'Ивановна', 'Максимовна', 'Дмитриевна', 'Никитична', 'Николаевна', 'Семеновна',
                              'Валерьевна', 'Петровна', 'Ивановна', 'Олеговна', 'Михайловна', 'Юрьевна', 'Антоновна', 'Игоревна', 'Сергеевна', 'Константиновна']

departments: list[str] = ['Отдел Java разработки',
                          'Отдел Python разработки',
                          'Отдел Frontend разработки',
                          'Отдел PHP разработки']

posts: list[str] = ['TeamLead',
                    'Senior разработчик',
                    'Middle разработчик',
                    'Junior разработчик',]

